hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_mcan_regs.h
/* Bitfield definition for register: TOCV */
/*
 * TOC (RC)
 *
 * Timeout Counter
 * The Timeout Counter is decremented in multiples of CAN bit times [1…16] depending on the configuration of TSCC.TCP.
 * When decremented to zero, interrupt flag IR.TOO is set and the Timeout Counter is stopped. Start and reset/restart conditions are configured via TOCC.TOS.
 * Note: Byte access: when TOCC.TOS = “00，writing one of the register bytes 3/2/1/0 will preset the Timeout Counter.
 */
#define MCAN_TOCV_TOC_MASK (0xFFFFU)
#define MCAN_TOCV_TOC_SHIFT (0U)
#define MCAN_TOCV_TOC_GET(x) (((uint32_t)(x) & MCAN_TOCV_TOC_MASK) >> MCAN_TOCV_TOC_SHIFT)

/* Bitfield definition for register: ECR */
/*
 * CEL (X)
 *
 * CAN Error Logging
 * The counter is incremented each time when a CAN protocol error causes the 8-bit Transmit Error Counter TEC or the 7-bit Receive Error Counter REC to be incremented.
 * The counter is also incremented when the Bus_Off limit is reached. It is not incremented when only RP is set without changing REC. The increment of CEL follows after the increment of REC or TEC.
 * The counter is reset by read access to CEL. The counter stops at 0xFF; the next increment of TEC or REC sets interrupt flag IR.ELO.
 * Note: Byte access: Reading byte 2 will reset CEL to zero, reading bytes 3/1/0 has no impact.
 */
#define MCAN_ECR_CEL_MASK (0xFF0000UL)
#define MCAN_ECR_CEL_SHIFT (16U)
#define MCAN_ECR_CEL_GET(x) (((uint32_t)(x) & MCAN_ECR_CEL_MASK) >> MCAN_ECR_CEL_SHIFT)

/*
 * RP (R)
 *
 * Receive Error Passive
 * 0= The Receive Error Counter is below the error passive level of 128
 * 1= The Receive Error Counter has reached the error passive level of 128
 */
#define MCAN_ECR_RP_MASK (0x8000U)
#define MCAN_ECR_RP_SHIFT (15U)
#define MCAN_ECR_RP_GET(x) (((uint32_t)(x) & MCAN_ECR_RP_MASK) >> MCAN_ECR_RP_SHIFT)

/*
 * REC (R)
 *
 * Receive Error Counter
 * Actual state of the Receive Error Counter, values between 0 and 127
 */
#define MCAN_ECR_REC_MASK (0x7F00U)
#define MCAN_ECR_REC_SHIFT (8U)
#define MCAN_ECR_REC_GET(x) (((uint32_t)(x) & MCAN_ECR_REC_MASK) >> MCAN_ECR_REC_SHIFT)

/*
 * TEC (R)
 *
 * Transmit Error Counter
 * Actual state of the Transmit Error Counter, values between 0 and 255
 * Note: When CCCR.ASM is set, the CAN protocol controller does not increment TEC and REC when a CAN protocol error is detected, but CEL is still incremented.
 */
#define MCAN_ECR_TEC_MASK (0xFFU)
#define MCAN_ECR_TEC_SHIFT (0U)
#define MCAN_ECR_TEC_GET(x) (((uint32_t)(x) & MCAN_ECR_TEC_MASK) >> MCAN_ECR_TEC_SHIFT)

/* Bitfield definition for register: PSR */
/*
 * TDCV (R)
 *
 * Transmitter Delay Compensation Value
 * Position of the secondary sample point, defined by the sum of the measured delay from m_can_tx to m_can_rx and TDCR.TDCO.
 * The SSP position is, in the data phase, the number of mtq between the start of the transmitted bit and the secondary sample point. Valid values are 0 to 127 mtq.
 */
#define MCAN_PSR_TDCV_MASK (0x7F0000UL)
#define MCAN_PSR_TDCV_SHIFT (16U)
#define MCAN_PSR_TDCV_GET(x) (((uint32_t)(x) & MCAN_PSR_TDCV_MASK) >> MCAN_PSR_TDCV_SHIFT)

/*
 * PXE (X)
 *
 * Protocol Exception Event
 * 0= No protocol exception event occurred since last read access
 * 1= Protocol exception event occurred
 * Note: Byte access: Reading byte 0 will reset PXE, reading bytes 3/2/1 has no impact.
 */
#define MCAN_PSR_PXE_MASK (0x4000U)
#define MCAN_PSR_PXE_SHIFT (14U)
#define MCAN_PSR_PXE_GET(x) (((uint32_t)(x) & MCAN_PSR_PXE_MASK) >> MCAN_PSR_PXE_SHIFT)

/*
 * RFDF (X)
 *
 * Received a CAN FD Message
 * This bit is set independent of acceptance filtering.
 * 0= Since this bit was reset by the CPU, no CAN FD message has been received
 * 1= Message in CAN FD format with FDF flag set has been received
 * Note: Byte access: Reading byte 0 will reset RFDF, reading bytes 3/2/1 has no impact.
 */
#define MCAN_PSR_RFDF_MASK (0x2000U)
#define MCAN_PSR_RFDF_SHIFT (13U)
#define MCAN_PSR_RFDF_GET(x) (((uint32_t)(x) & MCAN_PSR_RFDF_MASK) >> MCAN_PSR_RFDF_SHIFT)

/*
 * RBRS (X)
 *
 * BRS flag of last received CAN FD Message
 * This bit is set together with RFDF, independent of acceptance filtering.
 * 0= Last received CAN FD message did not have its BRS flag set
 * 1= Last received CAN FD message had its BRS flag set
 * Note: Byte access: Reading byte 0 will reset RBRS, reading bytes 3/2/1 has no impact.
 */
#define MCAN_PSR_RBRS_MASK (0x1000U)
#define MCAN_PSR_RBRS_SHIFT (12U)
#define MCAN_PSR_RBRS_GET(x) (((uint32_t)(x) & MCAN_PSR_RBRS_MASK) >> MCAN_PSR_RBRS_SHIFT)

/*
 * RESI (X)
 *
 * ESI flag of last received CAN FD Message
 * This bit is set together with RFDF, independent of acceptance filtering.
 * 0= Last received CAN FD message did not have its ESI flag set
 * 1= Last received CAN FD message had its ESI flag set
 * Note: Byte access: Reading byte 0 will reset RESI, reading bytes 3/2/1 has no impact.
 */
#define MCAN_PSR_RESI_MASK (0x800U)
#define MCAN_PSR_RESI_SHIFT (11U)
#define MCAN_PSR_RESI_GET(x) (((uint32_t)(x) & MCAN_PSR_RESI_MASK) >> MCAN_PSR_RESI_SHIFT)

/*
 * DLEC (S)
 *
 * Data Phase Last Error Code
 * Type of last error that occurred in the data phase of a CAN FD format frame with its BRS flag set.Coding is the same as for LEC. This field will be cleared to zero when a CAN FD format frame with
 * its BRS flag set has been transferred (reception or transmission) without error.
 * Note: Byte access: Reading byte 0 will set DLEC to “111”, reading bytes 3/2/1 has no impact.
 */
#define MCAN_PSR_DLEC_MASK (0x700U)
#define MCAN_PSR_DLEC_SHIFT (8U)
#define MCAN_PSR_DLEC_GET(x) (((uint32_t)(x) & MCAN_PSR_DLEC_MASK) >> MCAN_PSR_DLEC_SHIFT)

/*
 * BO (R)
 *
 * Bus_Off Status
 * 0= The M_CAN is not Bus_Off
 * 1= The M_CAN is in Bus_Off state
 */
#define MCAN_PSR_BO_MASK (0x80U)
#define MCAN_PSR_BO_SHIFT (7U)
#define MCAN_PSR_BO_GET(x) (((uint32_t)(x) & MCAN_PSR_BO_MASK) >> MCAN_PSR_BO_SHIFT)

/*
 * EW (R)
 *
 * Warning Status
 * 0= Both error counters are below the Error_Warning limit of 96
 * 1= At least one of error counter has reached the Error_Warning limit of 96
 */
#define MCAN_PSR_EW_MASK (0x40U)
#define MCAN_PSR_EW_SHIFT (6U)
#define MCAN_PSR_EW_GET(x) (((uint32_t)(x) & MCAN_PSR_EW_MASK) >> MCAN_PSR_EW_SHIFT)

