hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_mcan_regs.h
/*
 * BIDX (R)
 *
 * Buffer Index
 * Index of Rx FIFO element to which the message was stored. Only valid when MSI[1] = ‘1’.
 */
#define MCAN_HPMS_BIDX_MASK (0x3FU)
#define MCAN_HPMS_BIDX_SHIFT (0U)
#define MCAN_HPMS_BIDX_GET(x) (((uint32_t)(x) & MCAN_HPMS_BIDX_MASK) >> MCAN_HPMS_BIDX_SHIFT)

/* Bitfield definition for register: NDAT1 */
/*
 * ND1 (RW)
 *
 * New Data[31:0]
 * The register holds the New Data flags of Rx Buffers 0 to 31. The flags are set when the respective Rx Buffer has been updated from a received frame.
 * The flags remain set until the Host clears them.A flag is cleared by writing a ’1’ to the corresponding bit position. Writing a ’0’ has no effect. A hard reset will clear the register.
 * 0= Rx Buffer not updated
 * 1= Rx Buffer updated from new message
 */
#define MCAN_NDAT1_ND1_MASK (0xFFFFFFFFUL)
#define MCAN_NDAT1_ND1_SHIFT (0U)
#define MCAN_NDAT1_ND1_SET(x) (((uint32_t)(x) << MCAN_NDAT1_ND1_SHIFT) & MCAN_NDAT1_ND1_MASK)
#define MCAN_NDAT1_ND1_GET(x) (((uint32_t)(x) & MCAN_NDAT1_ND1_MASK) >> MCAN_NDAT1_ND1_SHIFT)

/* Bitfield definition for register: NDAT2 */
/*
 * ND2 (RW)
 *
 * New Data[63:32]
 * The register holds the New Data flags of Rx Buffers 32 to 63. The flags are set when the respective Rx Buffer has been updated from a received frame.
 * The flags remain set until the Host clears them. A flag is cleared by writing a ’1’ to the corresponding bit position. Writing a ’0’ has no effect. A hard reset will clear the register.
 * 0= Rx Buffer not updated
 * 1= Rx Buffer updated from new message
 */
#define MCAN_NDAT2_ND2_MASK (0xFFFFFFFFUL)
#define MCAN_NDAT2_ND2_SHIFT (0U)
#define MCAN_NDAT2_ND2_SET(x) (((uint32_t)(x) << MCAN_NDAT2_ND2_SHIFT) & MCAN_NDAT2_ND2_MASK)
#define MCAN_NDAT2_ND2_GET(x) (((uint32_t)(x) & MCAN_NDAT2_ND2_MASK) >> MCAN_NDAT2_ND2_SHIFT)

/* Bitfield definition for register: RXF0C */
/*
 * F0OM (RW)
 *
 * FIFO 0 Operation Mode
 * FIFO 0 can be operated in blocking or in overwrite mode (see Section 3.4.2).
 * 0= FIFO 0 blocking mode
 * 1= FIFO 0 overwrite mode
 */
#define MCAN_RXF0C_F0OM_MASK (0x80000000UL)
#define MCAN_RXF0C_F0OM_SHIFT (31U)
#define MCAN_RXF0C_F0OM_SET(x) (((uint32_t)(x) << MCAN_RXF0C_F0OM_SHIFT) & MCAN_RXF0C_F0OM_MASK)
#define MCAN_RXF0C_F0OM_GET(x) (((uint32_t)(x) & MCAN_RXF0C_F0OM_MASK) >> MCAN_RXF0C_F0OM_SHIFT)

/*
 * F0WM (RW)
 *
 * Rx FIFO 0 Watermark
 * 0= Watermark interrupt disabled
 * 1-64= Level for Rx FIFO 0 watermark interrupt (IR.RF0W)
 * >64= Watermark interrupt disabled
 */
#define MCAN_RXF0C_F0WM_MASK (0x7F000000UL)
#define MCAN_RXF0C_F0WM_SHIFT (24U)
#define MCAN_RXF0C_F0WM_SET(x) (((uint32_t)(x) << MCAN_RXF0C_F0WM_SHIFT) & MCAN_RXF0C_F0WM_MASK)
#define MCAN_RXF0C_F0WM_GET(x) (((uint32_t)(x) & MCAN_RXF0C_F0WM_MASK) >> MCAN_RXF0C_F0WM_SHIFT)

/*
 * F0S (RW)
 *
 * Rx FIFO 0 Size
 * 0= No Rx FIFO 0
 * 1-64= Number of Rx FIFO 0 elements
 * >64= Values greater than 64 are interpreted as 64
 * The Rx FIFO 0 elements are indexed from 0 to F0S-1
 */
#define MCAN_RXF0C_F0S_MASK (0x7F0000UL)
#define MCAN_RXF0C_F0S_SHIFT (16U)
#define MCAN_RXF0C_F0S_SET(x) (((uint32_t)(x) << MCAN_RXF0C_F0S_SHIFT) & MCAN_RXF0C_F0S_MASK)
#define MCAN_RXF0C_F0S_GET(x) (((uint32_t)(x) & MCAN_RXF0C_F0S_MASK) >> MCAN_RXF0C_F0S_SHIFT)

/*
 * F0SA (RW)
 *
 * Rx FIFO 0 Start Address
 * Start address of Rx FIFO 0 in Message RAM (32-bit word address)
 */
#define MCAN_RXF0C_F0SA_MASK (0xFFFCU)
#define MCAN_RXF0C_F0SA_SHIFT (2U)
#define MCAN_RXF0C_F0SA_SET(x) (((uint32_t)(x) << MCAN_RXF0C_F0SA_SHIFT) & MCAN_RXF0C_F0SA_MASK)
#define MCAN_RXF0C_F0SA_GET(x) (((uint32_t)(x) & MCAN_RXF0C_F0SA_MASK) >> MCAN_RXF0C_F0SA_SHIFT)

/* Bitfield definition for register: RXF0S */
/*
 * RF0L (R)
 *
 * Rx FIFO 0 Message Lost
 * This bit is a copy of interrupt flag IR.RF0L. When IR.RF0L is reset, this bit is also reset.
 * 0= No Rx FIFO 0 message lost
 * 1= Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero
 * Note: Overwriting the oldest message when RXF0C.F0OM = ‘1’ will not set this flag.
 */
#define MCAN_RXF0S_RF0L_MASK (0x2000000UL)
#define MCAN_RXF0S_RF0L_SHIFT (25U)
#define MCAN_RXF0S_RF0L_GET(x) (((uint32_t)(x) & MCAN_RXF0S_RF0L_MASK) >> MCAN_RXF0S_RF0L_SHIFT)

/*
 * F0F (R)
 *
 * Rx FIFO 0 Full
 * 0= Rx FIFO 0 not full
 * 1= Rx FIFO 0 full
 */
#define MCAN_RXF0S_F0F_MASK (0x1000000UL)
#define MCAN_RXF0S_F0F_SHIFT (24U)
#define MCAN_RXF0S_F0F_GET(x) (((uint32_t)(x) & MCAN_RXF0S_F0F_MASK) >> MCAN_RXF0S_F0F_SHIFT)

/*
 * F0PI (R)
 *
 * Rx FIFO 0 Put Index
 * Rx FIFO 0 write index pointer, range 0 to 63.
 */
#define MCAN_RXF0S_F0PI_MASK (0x3F0000UL)
#define MCAN_RXF0S_F0PI_SHIFT (16U)
#define MCAN_RXF0S_F0PI_GET(x) (((uint32_t)(x) & MCAN_RXF0S_F0PI_MASK) >> MCAN_RXF0S_F0PI_SHIFT)

/*
 * F0GI (R)
 *
 * Rx FIFO 0 Get Index
 * Rx FIFO 0 read index pointer, range 0 to 63.
 */
#define MCAN_RXF0S_F0GI_MASK (0x3F00U)
#define MCAN_RXF0S_F0GI_SHIFT (8U)
#define MCAN_RXF0S_F0GI_GET(x) (((uint32_t)(x) & MCAN_RXF0S_F0GI_MASK) >> MCAN_RXF0S_F0GI_SHIFT)

/*
 * F0FL (R)
 *
 * Rx FIFO 0 Fill Level
 * Number of elements stored in Rx FIFO 0, range 0 to 64.
 */
#define MCAN_RXF0S_F0FL_MASK (0x7FU)
#define MCAN_RXF0S_F0FL_SHIFT (0U)
#define MCAN_RXF0S_F0FL_GET(x) (((uint32_t)(x) & MCAN_RXF0S_F0FL_MASK) >> MCAN_RXF0S_F0FL_SHIFT)

/* Bitfield definition for register: RXF0A */
/*
 * F0AI (RW)
 *
 * Rx FIFO 0 Acknowledge Index
 * After the Host has read a message or a sequence of messages from Rx FIFO 0 it has to write the buffer index of the last element read from Rx FIFO 0 to F0AI.
 * This will set the Rx FIFO 0 Get Index RXF0S.F0GI to F0AI + 1 and update the FIFO 0 Fill Level RXF0S.F0FL.
 */
#define MCAN_RXF0A_F0AI_MASK (0x3FU)
#define MCAN_RXF0A_F0AI_SHIFT (0U)
#define MCAN_RXF0A_F0AI_SET(x) (((uint32_t)(x) << MCAN_RXF0A_F0AI_SHIFT) & MCAN_RXF0A_F0AI_MASK)
#define MCAN_RXF0A_F0AI_GET(x) (((uint32_t)(x) & MCAN_RXF0A_F0AI_MASK) >> MCAN_RXF0A_F0AI_SHIFT)

/* Bitfield definition for register: RXBC */
/*
 * RBSA (RW)
 *
 * Rx Buffer Start Address
 * Configures the start address of the Rx Buffers section in the Message RAM (32-bit word address).Also used to reference debug messages A,B,C.
 */
#define MCAN_RXBC_RBSA_MASK (0xFFFCU)
#define MCAN_RXBC_RBSA_SHIFT (2U)
#define MCAN_RXBC_RBSA_SET(x) (((uint32_t)(x) << MCAN_RXBC_RBSA_SHIFT) & MCAN_RXBC_RBSA_MASK)
#define MCAN_RXBC_RBSA_GET(x) (((uint32_t)(x) & MCAN_RXBC_RBSA_MASK) >> MCAN_RXBC_RBSA_SHIFT)

/* Bitfield definition for register: RXF1C */
/*
 * F1OM (RW)
 *
 * FIFO 1 Operation Mode
 * FIFO 1 can be operated in blocking or in overwrite mode (see Section 3.4.2).
 * 0= FIFO 1 blocking mode
 * 1= FIFO 1 overwrite mode
 */
#define MCAN_RXF1C_F1OM_MASK (0x80000000UL)
#define MCAN_RXF1C_F1OM_SHIFT (31U)
#define MCAN_RXF1C_F1OM_SET(x) (((uint32_t)(x) << MCAN_RXF1C_F1OM_SHIFT) & MCAN_RXF1C_F1OM_MASK)
#define MCAN_RXF1C_F1OM_GET(x) (((uint32_t)(x) & MCAN_RXF1C_F1OM_MASK) >> MCAN_RXF1C_F1OM_SHIFT)

