hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_mcan_regs.h
/*
 * TFQS (RW)
 *
 * Transmit FIFO/Queue Size
 * 0= No Tx FIFO/Queue
 * 1-32= Number of Tx Buffers used for Tx FIFO/Queue
 * >32= Values greater than 32 are interpreted as 32
 */
#define MCAN_TXBC_TFQS_MASK (0x3F000000UL)
#define MCAN_TXBC_TFQS_SHIFT (24U)
#define MCAN_TXBC_TFQS_SET(x) (((uint32_t)(x) << MCAN_TXBC_TFQS_SHIFT) & MCAN_TXBC_TFQS_MASK)
#define MCAN_TXBC_TFQS_GET(x) (((uint32_t)(x) & MCAN_TXBC_TFQS_MASK) >> MCAN_TXBC_TFQS_SHIFT)

/*
 * NDTB (RW)
 *
 * Number of Dedicated Transmit Buffers
 * 0= No Dedicated Tx Buffers
 * 1-32= Number of Dedicated Tx Buffers
 * >32= Values greater than 32 are interpreted as 32
 */
#define MCAN_TXBC_NDTB_MASK (0x3F0000UL)
#define MCAN_TXBC_NDTB_SHIFT (16U)
#define MCAN_TXBC_NDTB_SET(x) (((uint32_t)(x) << MCAN_TXBC_NDTB_SHIFT) & MCAN_TXBC_NDTB_MASK)
#define MCAN_TXBC_NDTB_GET(x) (((uint32_t)(x) & MCAN_TXBC_NDTB_MASK) >> MCAN_TXBC_NDTB_SHIFT)

/*
 * TBSA (RW)
 *
 * Tx Buffers Start Address
 * Start address of Tx Buffers section in Message RAM (32-bit word address, see Figure 2).
 * Note: Be aware that the sum of TFQS and NDTB may be not greater than 32. There is no check for erroneous configurations. The Tx Buffers section in the Message RAM starts with the dedicated Tx Buffers.
 */
#define MCAN_TXBC_TBSA_MASK (0xFFFCU)
#define MCAN_TXBC_TBSA_SHIFT (2U)
#define MCAN_TXBC_TBSA_SET(x) (((uint32_t)(x) << MCAN_TXBC_TBSA_SHIFT) & MCAN_TXBC_TBSA_MASK)
#define MCAN_TXBC_TBSA_GET(x) (((uint32_t)(x) & MCAN_TXBC_TBSA_MASK) >> MCAN_TXBC_TBSA_SHIFT)

/* Bitfield definition for register: TXFQS */
/*
 * TFQF (R)
 *
 * Tx FIFO/Queue Full
 * 0= Tx FIFO/Queue not full
 * 1= Tx FIFO/Queue full
 */
#define MCAN_TXFQS_TFQF_MASK (0x200000UL)
#define MCAN_TXFQS_TFQF_SHIFT (21U)
#define MCAN_TXFQS_TFQF_GET(x) (((uint32_t)(x) & MCAN_TXFQS_TFQF_MASK) >> MCAN_TXFQS_TFQF_SHIFT)

/*
 * TFQPI (R)
 *
 * Tx FIFO/Queue Put Index
 * Tx FIFO/Queue write index pointer, range 0 to 31.
 */
#define MCAN_TXFQS_TFQPI_MASK (0x1F0000UL)
#define MCAN_TXFQS_TFQPI_SHIFT (16U)
#define MCAN_TXFQS_TFQPI_GET(x) (((uint32_t)(x) & MCAN_TXFQS_TFQPI_MASK) >> MCAN_TXFQS_TFQPI_SHIFT)

/*
 * TFGI (R)
 *
 * Tx FIFO Get Index
 * Tx FIFO read index pointer, range 0 to 31. Read as zero when Tx Queue operation is configured
 * (TXBC.TFQM = ‘1’).
 */
#define MCAN_TXFQS_TFGI_MASK (0x1F00U)
#define MCAN_TXFQS_TFGI_SHIFT (8U)
#define MCAN_TXFQS_TFGI_GET(x) (((uint32_t)(x) & MCAN_TXFQS_TFGI_MASK) >> MCAN_TXFQS_TFGI_SHIFT)

/*
 * TFFL (R)
 *
 * Tx FIFO Free Level
 * Number of consecutive free Tx FIFO elements starting from TFGI, range 0 to 32. Read as zero when Tx Queue operation is configured (TXBC.TFQM = ‘1’)
 * Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with
 * the first dedicated Tx Buffers.
 * Example: For a configuration of 12 dedicated Tx Buffers and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth buffer of the Tx FIFO.
 */
#define MCAN_TXFQS_TFFL_MASK (0x3FU)
#define MCAN_TXFQS_TFFL_SHIFT (0U)
#define MCAN_TXFQS_TFFL_GET(x) (((uint32_t)(x) & MCAN_TXFQS_TFFL_MASK) >> MCAN_TXFQS_TFFL_SHIFT)

/* Bitfield definition for register: TXESC */
/*
 * TBDS (RW)
 *
 * Tx Buffer Data Field Size
 * 000= 8 byte data field
 * 001= 12 byte data field
 * 010= 16 byte data field
 * 011= 20 byte data field
 * 100= 24 byte data field
 * 101= 32 byte data field
 * 110= 48 byte data field
 * 111= 64 byte data field
 * Note: In case the data length code DLC of a Tx Buffer element is configured to a value higher than the Tx Buffer data field size TXESC.TBDS, the bytes not defined by the Tx Buffer are transmitted as “0xCC” (padding bytes).
 */
#define MCAN_TXESC_TBDS_MASK (0x7U)
#define MCAN_TXESC_TBDS_SHIFT (0U)
#define MCAN_TXESC_TBDS_SET(x) (((uint32_t)(x) << MCAN_TXESC_TBDS_SHIFT) & MCAN_TXESC_TBDS_MASK)
#define MCAN_TXESC_TBDS_GET(x) (((uint32_t)(x) & MCAN_TXESC_TBDS_MASK) >> MCAN_TXESC_TBDS_SHIFT)

/* Bitfield definition for register: TXBRP */
/*
 * TRP (R)
 *
 * Transmission Request Pending
 * Each Tx Buffer has its own Transmission Request Pending bit. The bits are set via register TXBAR.The bits are reset after a requested transmission has completed or has been cancelled via register
 * TXBCR.
 * TXBRP bits are set only for those Tx Buffers configured via TXBC. After a TXBRP bit has been set, a Tx scan (see Section 3.5, Tx Handling) is started to check for the pending Tx request with the
 * highest priority (Tx Buffer with lowest Message ID).
 * A cancellation request resets the corresponding transmission request pending bit of register TXBRP. In case a transmission has already been started when a cancellation is requested,
 * this is done at the end of the transmission, regardless whether the transmission was successful or not. The cancellation request bits are reset directly after the corresponding TXBRP bit has been reset.
 * After a cancellation has been requested, a finished cancellation is signalled via TXBCF
 * ? after successful transmission together with the corresponding TXBTO bit
 * ? when the transmission has not yet been started at the point of cancellation
 * ? when the transmission has been aborted due to lost arbitration
 * ? when an error occurred during frame transmission
 * In DAR mode all transmissions are automatically cancelled if they are not successful. The corresponding TXBCF bit is set for all unsuccessful transmissions.
 * 0= No transmission request pending
 * 1= Transmission request pending
 * Note: TXBRP bits which are set while a Tx scan is in progress are not considered during this particular Tx scan. In case a cancellation is requested for such a Tx Buffer, this Add Request is cancelled immediately, the corresponding TXBRP bit is reset.
 */
#define MCAN_TXBRP_TRP_MASK (0xFFFFFFFFUL)
#define MCAN_TXBRP_TRP_SHIFT (0U)
#define MCAN_TXBRP_TRP_GET(x) (((uint32_t)(x) & MCAN_TXBRP_TRP_MASK) >> MCAN_TXBRP_TRP_SHIFT)

/* Bitfield definition for register: TXBAR */
/*
 * AR (RW)
 *
 * Add Request
 * Each Tx Buffer has its own Add Request bit. Writing a ‘1’ will set the corresponding Add Request bit; writing a ‘0’ has no impact. This enables the Host to set transmission requests for multiple Tx
 * Buffers with one write to TXBAR. TXBAR bits are set only for those Tx Buffers configured via TXBC.
 * When no Tx scan is running, the bits are reset immediately, else the bits remain set until the Tx scan process has completed.
 * 0= No transmission request added
 * 1= Transmission requested added
 * Note: If an add request is applied for a Tx Buffer with pending transmission request (corresponding TXBRP bit already set), this add request is ignored.
 */
#define MCAN_TXBAR_AR_MASK (0xFFFFFFFFUL)
#define MCAN_TXBAR_AR_SHIFT (0U)
#define MCAN_TXBAR_AR_SET(x) (((uint32_t)(x) << MCAN_TXBAR_AR_SHIFT) & MCAN_TXBAR_AR_MASK)
#define MCAN_TXBAR_AR_GET(x) (((uint32_t)(x) & MCAN_TXBAR_AR_MASK) >> MCAN_TXBAR_AR_SHIFT)

/* Bitfield definition for register: TXBCR */
/*
 * CR (RW)
 *
 * Cancellation Request
 * Each Tx Buffer has its own Cancellation Request bit. Writing a ‘1’ will set the corresponding Cancellation Request bit; writing a ‘0’ has no impact.
 * This enables the Host to set cancellation requests for multiple Tx Buffers with one write to TXBCR. TXBCR bits are set only for those Tx Buffers configured via TXBC. The bits remain set until the corresponding bit of TXBRP is reset.
 * 0= No cancellation pending
 * 1= Cancellation pending
 */
#define MCAN_TXBCR_CR_MASK (0xFFFFFFFFUL)
#define MCAN_TXBCR_CR_SHIFT (0U)
#define MCAN_TXBCR_CR_SET(x) (((uint32_t)(x) << MCAN_TXBCR_CR_SHIFT) & MCAN_TXBCR_CR_MASK)
#define MCAN_TXBCR_CR_GET(x) (((uint32_t)(x) & MCAN_TXBCR_CR_MASK) >> MCAN_TXBCR_CR_SHIFT)

/* Bitfield definition for register: TXBTO */
/*
 * TO (R)
 *
 * Transmission Occurred
 * Each Tx Buffer has its own Transmission Occurred bit. The bits are set when the corresponding TXBRP bit is cleared after a successful transmission. The bits are reset when a new transmission is requested by writing a ‘1’ to the corresponding bit of register TXBAR.
 * 0= No transmission occurred
 * 1= Transmission occurred
 */
#define MCAN_TXBTO_TO_MASK (0xFFFFFFFFUL)
#define MCAN_TXBTO_TO_SHIFT (0U)
#define MCAN_TXBTO_TO_GET(x) (((uint32_t)(x) & MCAN_TXBTO_TO_MASK) >> MCAN_TXBTO_TO_SHIFT)

/* Bitfield definition for register: TXBCF */
/*
 * CF (R)
 *
 * Cancellation Finished
 * Each Tx Buffer has its own Cancellation Finished bit. The bits are set when the corresponding TXBRP bit is cleared after a cancellation was requested via TXBCR.
 * In case the corresponding TXBRP bit was not set at the point of cancellation, CF is set immediately. The bits are reset when a new transmission is requested by writing a ‘1’ to the corresponding bit of register TXBAR.
 * 0= No transmit buffer cancellation
 * 1= Transmit buffer cancellation finished
 */
#define MCAN_TXBCF_CF_MASK (0xFFFFFFFFUL)
#define MCAN_TXBCF_CF_SHIFT (0U)
#define MCAN_TXBCF_CF_GET(x) (((uint32_t)(x) & MCAN_TXBCF_CF_MASK) >> MCAN_TXBCF_CF_SHIFT)

/* Bitfield definition for register: TXBTIE */
/*
 * TIE (RW)
 *
 * Transmission Interrupt Enable
 * Each Tx Buffer has its own Transmission Interrupt Enable bit.
 * 0= Transmission interrupt disabled
 * 1= Transmission interrupt enable
 */
#define MCAN_TXBTIE_TIE_MASK (0xFFFFFFFFUL)
#define MCAN_TXBTIE_TIE_SHIFT (0U)
#define MCAN_TXBTIE_TIE_SET(x) (((uint32_t)(x) << MCAN_TXBTIE_TIE_SHIFT) & MCAN_TXBTIE_TIE_MASK)
#define MCAN_TXBTIE_TIE_GET(x) (((uint32_t)(x) & MCAN_TXBTIE_TIE_MASK) >> MCAN_TXBTIE_TIE_SHIFT)

/* Bitfield definition for register: TXBCIE */
/*
 * CFIE (RW)
 *
 * Cancellation Finished Interrupt Enable
 * Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
 * 0= Cancellation finished interrupt disabled
 * 1= Cancellation finished interrupt enabled
 */
#define MCAN_TXBCIE_CFIE_MASK (0xFFFFFFFFUL)
#define MCAN_TXBCIE_CFIE_SHIFT (0U)
#define MCAN_TXBCIE_CFIE_SET(x) (((uint32_t)(x) << MCAN_TXBCIE_CFIE_SHIFT) & MCAN_TXBCIE_CFIE_MASK)
#define MCAN_TXBCIE_CFIE_GET(x) (((uint32_t)(x) & MCAN_TXBCIE_CFIE_MASK) >> MCAN_TXBCIE_CFIE_SHIFT)

/* Bitfield definition for register: TXEFC */
/*
 * EFWM (RW)
 *
 * Event FIFO Watermark
 * 0= Watermark interrupt disabled
 * 1-32= Level for Tx Event FIFO watermark interrupt (IR.TEFW)
 * >32= Watermark interrupt disabled
 */
#define MCAN_TXEFC_EFWM_MASK (0x3F000000UL)
#define MCAN_TXEFC_EFWM_SHIFT (24U)
#define MCAN_TXEFC_EFWM_SET(x) (((uint32_t)(x) << MCAN_TXEFC_EFWM_SHIFT) & MCAN_TXEFC_EFWM_MASK)
#define MCAN_TXEFC_EFWM_GET(x) (((uint32_t)(x) & MCAN_TXEFC_EFWM_MASK) >> MCAN_TXEFC_EFWM_SHIFT)

