hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_mcan_regs.h
/*
 * EFS (RW)
 *
 * Event FIFO Size
 * 0= Tx Event FIFO disabled
 * 1-32= Number of Tx Event FIFO elements
 * >32= Values greater than 32 are interpreted as 32
 * The Tx Event FIFO elements are indexed from 0 to EFS - 1
 */
#define MCAN_TXEFC_EFS_MASK (0x3F0000UL)
#define MCAN_TXEFC_EFS_SHIFT (16U)
#define MCAN_TXEFC_EFS_SET(x) (((uint32_t)(x) << MCAN_TXEFC_EFS_SHIFT) & MCAN_TXEFC_EFS_MASK)
#define MCAN_TXEFC_EFS_GET(x) (((uint32_t)(x) & MCAN_TXEFC_EFS_MASK) >> MCAN_TXEFC_EFS_SHIFT)

/*
 * EFSA (RW)
 *
 * Event FIFO Start Address
 * Start address of Tx Event FIFO in Message RAM (32-bit word address)
 */
#define MCAN_TXEFC_EFSA_MASK (0xFFFCU)
#define MCAN_TXEFC_EFSA_SHIFT (2U)
#define MCAN_TXEFC_EFSA_SET(x) (((uint32_t)(x) << MCAN_TXEFC_EFSA_SHIFT) & MCAN_TXEFC_EFSA_MASK)
#define MCAN_TXEFC_EFSA_GET(x) (((uint32_t)(x) & MCAN_TXEFC_EFSA_MASK) >> MCAN_TXEFC_EFSA_SHIFT)

/* Bitfield definition for register: TXEFS */
/*
 * TEFL (R)
 *
 * Tx Event FIFO Element Lost
 * This bit is a copy of interrupt flag IR.TEFL. When IR.TEFL is reset, this bit is also reset.
 * 0= No Tx Event FIFO element lost
 * 1= Tx Event FIFO element lost, also set after write attempt to Tx Event FIFO of size zero.
 */
#define MCAN_TXEFS_TEFL_MASK (0x2000000UL)
#define MCAN_TXEFS_TEFL_SHIFT (25U)
#define MCAN_TXEFS_TEFL_GET(x) (((uint32_t)(x) & MCAN_TXEFS_TEFL_MASK) >> MCAN_TXEFS_TEFL_SHIFT)

/*
 * EFF (R)
 *
 * Event FIFO Full
 * 0= Tx Event FIFO not full
 * 1= Tx Event FIFO full
 */
#define MCAN_TXEFS_EFF_MASK (0x1000000UL)
#define MCAN_TXEFS_EFF_SHIFT (24U)
#define MCAN_TXEFS_EFF_GET(x) (((uint32_t)(x) & MCAN_TXEFS_EFF_MASK) >> MCAN_TXEFS_EFF_SHIFT)

/*
 * EFPI (R)
 *
 * Event FIFO Put Index
 * Tx Event FIFO write index pointer, range 0 to 31.
 */
#define MCAN_TXEFS_EFPI_MASK (0x1F0000UL)
#define MCAN_TXEFS_EFPI_SHIFT (16U)
#define MCAN_TXEFS_EFPI_GET(x) (((uint32_t)(x) & MCAN_TXEFS_EFPI_MASK) >> MCAN_TXEFS_EFPI_SHIFT)

/*
 * EFGI (R)
 *
 * Event FIFO Get Index
 * Tx Event FIFO read index pointer, range 0 to 31.
 */
#define MCAN_TXEFS_EFGI_MASK (0x1F00U)
#define MCAN_TXEFS_EFGI_SHIFT (8U)
#define MCAN_TXEFS_EFGI_GET(x) (((uint32_t)(x) & MCAN_TXEFS_EFGI_MASK) >> MCAN_TXEFS_EFGI_SHIFT)

/*
 * EFFL (R)
 *
 * Event FIFO Fill Level
 * Number of elements stored in Tx Event FIFO, range 0 to 32.
 */
#define MCAN_TXEFS_EFFL_MASK (0x3FU)
#define MCAN_TXEFS_EFFL_SHIFT (0U)
#define MCAN_TXEFS_EFFL_GET(x) (((uint32_t)(x) & MCAN_TXEFS_EFFL_MASK) >> MCAN_TXEFS_EFFL_SHIFT)

/* Bitfield definition for register: TXEFA */
/*
 * EFAI (RW)
 *
 * Event FIFO Acknowledge Index
 * After the Host has read an element or a sequence of elements from the Tx Event FIFO it has to write the index of the last element read from Tx Event FIFO to EFAI. This will set the Tx Event FIFO Get
 * Index TXEFS.EFGI to EFAI + 1 and update the Event FIFO Fill Level TXEFS.EFFL.
 */
#define MCAN_TXEFA_EFAI_MASK (0x1FU)
#define MCAN_TXEFA_EFAI_SHIFT (0U)
#define MCAN_TXEFA_EFAI_SET(x) (((uint32_t)(x) << MCAN_TXEFA_EFAI_SHIFT) & MCAN_TXEFA_EFAI_MASK)
#define MCAN_TXEFA_EFAI_GET(x) (((uint32_t)(x) & MCAN_TXEFA_EFAI_MASK) >> MCAN_TXEFA_EFAI_SHIFT)

/* Bitfield definition for register array: TS_SEL */
/*
 * TS (R)
 *
 * Timestamp Word TS
 * default can save 16 timestamps with 32bit;
 * if ts64_en is set, then work at 64bit mode, can save 8 timestamps with 01/23/45….
 */
#define MCAN_TS_SEL_TS_MASK (0xFFFFFFFFUL)
#define MCAN_TS_SEL_TS_SHIFT (0U)
#define MCAN_TS_SEL_TS_GET(x) (((uint32_t)(x) & MCAN_TS_SEL_TS_MASK) >> MCAN_TS_SEL_TS_SHIFT)

/* Bitfield definition for register: CREL */
/*
 * REL (R)
 *
 * Core Release
 * One digit, BCD-coded
 */
#define MCAN_CREL_REL_MASK (0xF0000000UL)
#define MCAN_CREL_REL_SHIFT (28U)
#define MCAN_CREL_REL_GET(x) (((uint32_t)(x) & MCAN_CREL_REL_MASK) >> MCAN_CREL_REL_SHIFT)

/*
 * STEP (R)
 *
 * Step of Core Release
 * One digit, BCD-coded.
 */
#define MCAN_CREL_STEP_MASK (0xF000000UL)
#define MCAN_CREL_STEP_SHIFT (24U)
#define MCAN_CREL_STEP_GET(x) (((uint32_t)(x) & MCAN_CREL_STEP_MASK) >> MCAN_CREL_STEP_SHIFT)

/*
 * SUBSTEP (R)
 *
 * Sub-step of Core Release
 * One digit, BCD-coded
 */
#define MCAN_CREL_SUBSTEP_MASK (0xF00000UL)
#define MCAN_CREL_SUBSTEP_SHIFT (20U)
#define MCAN_CREL_SUBSTEP_GET(x) (((uint32_t)(x) & MCAN_CREL_SUBSTEP_MASK) >> MCAN_CREL_SUBSTEP_SHIFT)

/*
 * YEAR (R)
 *
 * Timestamp Year
 * One digit, BCD-coded. This field is set by generic parameter on
 * synthesis.
 */
#define MCAN_CREL_YEAR_MASK (0xF0000UL)
#define MCAN_CREL_YEAR_SHIFT (16U)
#define MCAN_CREL_YEAR_GET(x) (((uint32_t)(x) & MCAN_CREL_YEAR_MASK) >> MCAN_CREL_YEAR_SHIFT)

/*
 * MON (R)
 *
 * Timestamp Month
 * Two digits, BCD-coded. This field is set by generic parameter
 * on synthesis.
 */
#define MCAN_CREL_MON_MASK (0xFF00U)
#define MCAN_CREL_MON_SHIFT (8U)
#define MCAN_CREL_MON_GET(x) (((uint32_t)(x) & MCAN_CREL_MON_MASK) >> MCAN_CREL_MON_SHIFT)

/*
 * DAY (R)
 *
 * Timestamp Day
 * Two digits, BCD-coded. This field is set by generic parameter
 * on synthesis.
 */
#define MCAN_CREL_DAY_MASK (0xFFU)
#define MCAN_CREL_DAY_SHIFT (0U)
#define MCAN_CREL_DAY_GET(x) (((uint32_t)(x) & MCAN_CREL_DAY_MASK) >> MCAN_CREL_DAY_SHIFT)

/* Bitfield definition for register: TSCFG */
/*
 * TBPRE (RW)
 *
 * Timebase Prescaler
 * 0x00 to 0xFF
 * The value by which the oscillator frequency is divided for
 * generating the timebase counter clock. Valid values for the
 * Timebase Prescaler are 0 to 255. The actual interpretation by
 * the hardware of this value is such that one more than the value
 * programmed here is used. Affects only the TSU internal
 * timebase. When the internal timebase is excluded by synthesis,
 * TBPRE[7:0] is fixed to 0x00, the Timestamp Prescaler is not
 * used.
 */
#define MCAN_TSCFG_TBPRE_MASK (0xFF00U)
#define MCAN_TSCFG_TBPRE_SHIFT (8U)
#define MCAN_TSCFG_TBPRE_SET(x) (((uint32_t)(x) << MCAN_TSCFG_TBPRE_SHIFT) & MCAN_TSCFG_TBPRE_MASK)
#define MCAN_TSCFG_TBPRE_GET(x) (((uint32_t)(x) & MCAN_TSCFG_TBPRE_MASK) >> MCAN_TSCFG_TBPRE_SHIFT)

/*
 * EN64 (RW)
 *
 * set to use 64bit timestamp.
 * when enabled, tsu can save up to 8 different timestamps, TS(k) and TS(k+1) are used for one 64bit timestamp, k is 0~7.
 * TSP can be used to select different one
 */
#define MCAN_TSCFG_EN64_MASK (0x8U)
#define MCAN_TSCFG_EN64_SHIFT (3U)
#define MCAN_TSCFG_EN64_SET(x) (((uint32_t)(x) << MCAN_TSCFG_EN64_SHIFT) & MCAN_TSCFG_EN64_MASK)
#define MCAN_TSCFG_EN64_GET(x) (((uint32_t)(x) & MCAN_TSCFG_EN64_MASK) >> MCAN_TSCFG_EN64_SHIFT)

